#include "MMMSAA.h"

int main(){
    //测试用例(1)
    vector<Task> D = {"t1", "t2", "t3", "t4", "t5", "t6", "t7", "t8", "t9", "t10"}; // 任务集合
    vector<vector<double>> C = {
        {0, 1, 0, 0, 0, 0, 4, 0, 2, 0},
        {1, 0, 3, 0, 0, 0, 0, 0, 0, 0},
        {0, 3, 0, 0, 0, 0, 0, 2, 0, 1},
        {0, 0, 0, 0, 0, 2, 0, 5, 6, 0},
        {0, 0, 0, 0, 0, 0, 0, 3, 7, 8},
        {0, 0, 0, 2, 0, 0, 1, 0, 0, 0},
        {4, 0, 0, 0, 0, 1, 0, 0, 0, 0},
        {0, 0, 2 ,5 ,3, 0, 0, 0, 0, 0},
        {2, 0, 0, 6 ,7, 0, 0, 0, 0, 0},
        {0, 0, 1 ,0 ,8 ,0, 0, 0, 0, 0}
    };// 通信代价矩阵
    int M = 3; // 划分模块总数
    int EN = 4; // 每个模块的任务数的最大上限

    // //测试用例(2)
    // vector<Task> D = {"a", "b", "c", "d", "e", "f", "g", "h"}; // 任务集合
    // vector<vector<double>> C = {
    //     {0, 0, 0.5, 0, 0.5, 0, 0, 0},
    //     {0, 0, 0.5, 0.5, 0, 0, 0, 0},
    //     {0.5, 0.5, 0, 0.5, 1, 0.5, 0, 0},
    //     {0, 0.5, 0.5, 0, 0, 1, 0, 0},
    //     {0.5, 0, 1, 0, 0, 0.5, 1, 0},
    //     {0, 0, 0.5, 1, 0.5, 0, 0.5, 0.5},
    //     {0, 0, 0, 0, 1, 0.5, 0, 0.5},
    //     {0, 0, 0, 0, 0, 0.5, 0.5, 0}
    // };// 通信代价矩阵
    // int M = 2; // 划分模块总数
    // int EN = 4; // 每个模块的任务数的最大上限
    vector<PartitionResult> DE = MMMSAA(D, C, M, EN); // 调用MMMSAA算法
    printPartitionResult(DE,D,C); // 打印划分结果
    return 0;
}